# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Distributed revision control system
brew "git"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
cask "font-jetbrains-mono-nerd-font"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Java IDE by JetBrains
cask "intellij-idea"
# Digital note taking app
cask "microsoft-onenote"
# Instant messaging application focusing on security
cask "signal"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "yzhang.markdown-all-in-one"
